app/controllers/events_controller.rb

INSERT INTO "events" ("owner_id", "name", "place", "start_time", "end_time", "content", "created_at", "updated_at", "event_image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = current_user.created_events.build(event_params)
    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."event_id" = ? LIMIT ?  [["user_id", 1], ["event_id", 1], ["LIMIT", 1]]
---
  def show
    @event = Event.find(params[:id])
    @ticket = current_user && current_user.tickets.find_by(event_id: params[:id])

UPDATE "events" SET "event_image" = ?, "content" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event_image", "36岩木山.jpg"], ["content", "aomori"], ["updated_at", "2018-05-29 10:35:13.852039"], ["id", 11]]
---
  def update
   @event = current_user.created_events.find(params[:id])
   if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    @event = current_user.created_events.find(params[:id])
    @event.destroy!