app/controllers/tickets_controller.rb

  def create
    ticket = current_user.tickets.build do |t|
      t.event_id = params[:event_id]
      t.comment = params[:ticket][:comment]
    end
    if ticket.save
---
INSERT INTO "tickets" ("user_id", "event_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["event_id", 1], ["comment", "japan"], ["created_at", "2018-05-28 13:22:48.091537"], ["updated_at", "2018-05-28 13:22:48.091537"]]

  def destroy
    ticket = current_user.tickets.find_by!(event_id: params[:event_id])
    ticket.destroy!
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."event_id" = ? LIMIT ?  [["user_id", 1], ["event_id", 1], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]