app/controllers/welcome_controller.rb

  def index
#    @events = Event.page(params[:page]).per(PER).
#      where('start_time > ?', Time.zone.now).order(:start_time)
    @q = Event.page(params[:page]).per(PER).order(:start_time).search(search_params)
---
SELECT  "events".* FROM "events" WHERE (start_time > '2018-02-07 13:57:19.851132') ORDER BY "events"."start_time" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(DISTINCT "events"."id") FROM "events" WHERE ("events"."start_time" >= '2018-02-07 14:36:00.488177')