app/models/user.rb

INSERT INTO "users" ("provider", "uid", "nickname", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT ?  [["provider", "twitter"], ["uid", "2858120226"], ["LIMIT", 1]]
---
  def self.find_or_create_from_auth_hash(auth_hash)
	  provider = auth_hash[:provider]
	  uid = auth_hash[:uid]
	  nickname = auth_hash[:info][:nickname]
	  image_url = auth_hash[:info][:image]

          User.find_or_create_by(provider: provider, uid: uid) do |user|